evaluation_tests/test2_webserver/tc2_html_curve/step01_rps200__.txt
Running 30s test @ http://54.235.233.71/
  4 threads and 256 connections
  Thread calibration: mean lat.: 127.698ms, rate sampling interval: 436ms
  Thread calibration: mean lat.: 127.988ms, rate sampling interval: 434ms
  Thread calibration: mean lat.: 127.358ms, rate sampling interval: 434ms
  Thread calibration: mean lat.: 126.988ms, rate sampling interval: 437ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   113.69ms   10.08ms 184.19ms   90.89%
    Req/Sec    51.46     54.58   147.00     76.92%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  111.23ms
 75.000%  114.62ms
 90.000%  122.62ms
 99.000%  158.85ms
 99.900%  179.07ms
 99.990%  184.32ms
 99.999%  184.32ms
100.000%  184.32ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     104.703     0.000000            1         1.00
     106.559     0.100000          410         1.11
     107.391     0.200000          837         1.25
     108.415     0.300000         1243         1.43
     110.079     0.400000         1639         1.67
     111.231     0.500000         2080         2.00
     111.615     0.550000         2253         2.22
     112.191     0.600000         2476         2.50
     112.767     0.650000         2671         2.86
     113.599     0.700000         2871         3.33
     114.623     0.750000         3072         4.00
     115.263     0.775000         3178         4.44
     116.287     0.800000         3284         5.00
     117.183     0.825000         3384         5.71
     118.463     0.850000         3487         6.67
     120.383     0.875000         3584         8.00
     121.791     0.887500         3636         8.89
     122.751     0.900000         3689        10.00
     124.543     0.912500         3738        11.43
     126.655     0.925000         3789        13.33
     129.855     0.937500         3841        16.00
     131.711     0.943750         3868        17.78
     133.375     0.950000         3893        20.00
     136.703     0.956250         3917        22.86
     139.007     0.962500         3943        26.67
     142.591     0.968750         3968        32.00
     145.023     0.971875         3981        35.56
     147.455     0.975000         3994        40.00
     149.375     0.978125         4007        45.71
     152.191     0.981250         4021        53.33
     153.855     0.984375         4033        64.00
     156.287     0.985938         4039        71.11
     157.439     0.987500         4045        80.00
     158.719     0.989062         4054        91.43
     158.975     0.990625         4058       106.67
     162.687     0.992188         4064       128.00
     163.839     0.992969         4068       142.22
     164.479     0.993750         4071       160.00
     167.807     0.994531         4074       182.86
     167.935     0.995313         4077       213.33
     168.959     0.996094         4080       256.00
     169.215     0.996484         4082       284.44
     172.159     0.996875         4084       320.00
     173.055     0.997266         4085       365.71
     173.567     0.997656         4087       426.67
     173.823     0.998047         4088       512.00
     175.103     0.998242         4089       568.89
     178.431     0.998437         4090       640.00
     178.687     0.998633         4091       731.43
     179.071     0.998828         4092       853.33
     179.071     0.999023         4092      1024.00
     179.327     0.999121         4093      1137.78
     179.327     0.999219         4093      1280.00
     184.191     0.999316         4094      1462.86
     184.191     0.999414         4094      1706.67
     184.191     0.999512         4094      2048.00
     184.319     0.999561         4096      2275.56
     184.319     1.000000         4096          inf
#[Mean    =      113.694, StdDeviation   =       10.084]
#[Max     =      184.192, Total count    =         4096]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6144 requests in 30.33s, 4.30MB read
Requests/sec:    202.58
Transfer/sec:    145.21KB