evaluation_tests/test2_webserver/tc2_html_curve/step02_rps400__.txt
Running 30s test @ http://54.235.233.71/
  4 threads and 256 connections
  Thread calibration: mean lat.: 118.807ms, rate sampling interval: 249ms
  Thread calibration: mean lat.: 118.486ms, rate sampling interval: 249ms
  Thread calibration: mean lat.: 118.446ms, rate sampling interval: 246ms
  Thread calibration: mean lat.: 124.177ms, rate sampling interval: 253ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   120.95ms   38.90ms 566.27ms   95.10%
    Req/Sec   100.19     84.54   253.00     52.37%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  111.81ms
 75.000%  116.42ms
 90.000%  127.74ms
 99.000%  324.86ms
 99.900%  426.24ms
 99.990%  438.02ms
 99.999%  566.78ms
100.000%  566.78ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     104.575     0.000000            1         1.00
     106.623     0.100000          799         1.11
     107.711     0.200000         1613         1.25
     109.119     0.300000         2388         1.43
     110.719     0.400000         3183         1.67
     111.807     0.500000         4005         2.00
     112.383     0.550000         4397         2.22
     113.087     0.600000         4775         2.50
     114.047     0.650000         5160         2.86
     115.199     0.700000         5574         3.33
     116.415     0.750000         5968         4.00
     117.247     0.775000         6160         4.44
     118.143     0.800000         6363         5.00
     118.911     0.825000         6564         5.71
     120.383     0.850000         6752         6.67
     123.135     0.875000         6945         8.00
     125.119     0.887500         7045         8.89
     127.807     0.900000         7145        10.00
     130.111     0.912500         7242        11.43
     136.063     0.925000         7341        13.33
     138.111     0.937500         7441        16.00
     148.991     0.943750         7490        17.78
     156.543     0.950000         7540        20.00
     167.551     0.956250         7591        22.86
     188.287     0.962500         7640        26.67
     229.247     0.968750         7689        32.00
     258.943     0.971875         7713        35.56
     284.415     0.975000         7738        40.00
     303.359     0.978125         7774        45.71
     303.871     0.981250         7792        53.33
     305.919     0.984375         7816        64.00
     317.695     0.985938         7825        71.11
     324.095     0.987500         7842        80.00
     324.607     0.989062         7855        91.43
     324.863     0.990625         7862       106.67
     353.791     0.992188         7874       128.00
     356.863     0.992969         7881       142.22
     364.287     0.993750         7887       160.00
     368.383     0.994531         7893       182.86
     376.319     0.995313         7899       213.33
     381.695     0.996094         7905       256.00
     386.047     0.996484         7909       284.44
     388.095     0.996875         7912       320.00
     391.679     0.997266         7915       365.71
     401.151     0.997656         7919       426.67
     405.759     0.998047         7921       512.00
     410.879     0.998242         7923       568.89
     411.647     0.998437         7924       640.00
     420.607     0.998633         7926       731.43
     421.375     0.998828         7927       853.33
     428.031     0.999023         7929      1024.00
     428.799     0.999121         7930      1137.78
     428.799     0.999219         7930      1280.00
     431.103     0.999316         7931      1462.86
     435.199     0.999414         7932      1706.67
     436.223     0.999512         7933      2048.00
     436.223     0.999561         7933      2275.56
     436.223     0.999609         7933      2560.00
     437.759     0.999658         7934      2925.71
     437.759     0.999707         7934      3413.33
     438.015     0.999756         7935      4096.00
     438.015     0.999780         7935      4551.11
     438.015     0.999805         7935      5120.00
     438.015     0.999829         7935      5851.43
     438.015     0.999854         7935      6826.67
     566.783     0.999878         7936      8192.00
     566.783     1.000000         7936          inf
#[Mean    =      120.952, StdDeviation   =       38.895]
#[Max     =      566.272, Total count    =         7936]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  11971 requests in 30.32s, 8.38MB read
Requests/sec:    394.76
Transfer/sec:    282.96KB