evaluation_tests/test2_webserver/tc2_html_curve/step03_rps800__.txt
Running 30s test @ http://54.235.233.71/
  4 threads and 256 connections
  Thread calibration: mean lat.: 113.786ms, rate sampling interval: 232ms
  Thread calibration: mean lat.: 113.904ms, rate sampling interval: 232ms
  Thread calibration: mean lat.: 113.743ms, rate sampling interval: 231ms
  Thread calibration: mean lat.: 117.887ms, rate sampling interval: 245ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   138.53ms   79.44ms 825.86ms   92.37%
    Req/Sec   200.01     65.83   518.00     87.43%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  113.34ms
 75.000%  123.20ms
 90.000%  179.97ms
 99.000%  480.77ms
 99.900%  742.40ms
 99.990%  813.05ms
 99.999%  826.37ms
100.000%  826.37ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     104.511     0.000000            1         1.00
     107.007     0.100000         1586         1.11
     108.543     0.200000         3163         1.25
     110.591     0.300000         4798         1.43
     111.743     0.400000         6328         1.67
     113.343     0.500000         7928         2.00
     114.303     0.550000         8687         2.22
     115.583     0.600000         9478         2.50
     117.183     0.650000        10279         2.86
     119.487     0.700000        11059         3.33
     123.199     0.750000        11838         4.00
     125.759     0.775000        12225         4.44
     129.535     0.800000        12625         5.00
     134.783     0.825000        13016         5.71
     144.639     0.850000        13414         6.67
     160.895     0.875000        13803         8.00
     169.343     0.887500        14000         8.89
     179.967     0.900000        14197        10.00
     189.439     0.912500        14394        11.43
     224.383     0.925000        14591        13.33
     258.431     0.937500        14790        16.00
     269.311     0.943750        14887        17.78
     283.135     0.950000        14989        20.00
     305.151     0.956250        15085        22.86
     365.567     0.962500        15183        26.67
     434.175     0.968750        15283        32.00
     442.879     0.971875        15331        35.56
     444.927     0.975000        15380        40.00
     452.351     0.978125        15433        45.71
     456.191     0.981250        15480        53.33
     460.799     0.984375        15529        64.00
     463.103     0.985938        15553        71.11
     467.967     0.987500        15578        80.00
     475.391     0.989062        15603        91.43
     485.631     0.990625        15627       106.67
     507.647     0.992188        15653       128.00
     562.175     0.992969        15664       142.22
     608.767     0.993750        15676       160.00
     627.199     0.994531        15688       182.86
     640.511     0.995313        15701       213.33
     646.655     0.996094        15713       256.00
     650.239     0.996484        15720       284.44
     653.823     0.996875        15726       320.00
     655.871     0.997266        15734       365.71
     658.943     0.997656        15738       426.67
     662.527     0.998047        15744       512.00
     666.623     0.998242        15747       568.89
     688.639     0.998437        15750       640.00
     703.487     0.998633        15753       731.43
     736.767     0.998828        15756       853.33
     742.911     0.999023        15759      1024.00
     757.759     0.999121        15761      1137.78
     758.271     0.999219        15762      1280.00
     774.655     0.999316        15764      1462.86
     776.703     0.999414        15765      1706.67
     778.239     0.999512        15767      2048.00
     778.751     0.999561        15768      2275.56
     778.751     0.999609        15768      2560.00
     779.263     0.999658        15769      2925.71
     782.335     0.999707        15770      3413.33
     782.847     0.999756        15771      4096.00
     782.847     0.999780        15771      4551.11
     782.847     0.999805        15771      5120.00
     813.055     0.999829        15772      5851.43
     813.055     0.999854        15772      6826.67
     822.271     0.999878        15773      8192.00
     822.271     0.999890        15773      9102.22
     822.271     0.999902        15773     10240.00
     822.271     0.999915        15773     11702.86
     822.271     0.999927        15773     13653.33
     826.367     0.999939        15774     16384.00
     826.367     1.000000        15774          inf
#[Mean    =      138.535, StdDeviation   =       79.442]
#[Max     =      825.856, Total count    =        15774]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  23762 requests in 30.23s, 16.63MB read
Requests/sec:    785.94
Transfer/sec:    563.36KB